In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import os

In [2]:
os.listdir()

['.ipynb_checkpoints',
 'car data.csv',
 'Linear Regression.ipynb',
 'Linear_two.ipynb',
 'marital status.csv',
 'nasdaq100.csv',
 'Salary Data.csv']

In [4]:
#csv read ,(sep===> means separator)
df=pd.read_csv('nasdaq100.csv',sep=';')
df

        Date  Starting (USD)  Ending (USD)
0   01.01.24           16800         16500
1   01.12.23           15900         16100
2   01.11.23           15800         15300
3   01.10.23           16100         16200
4   01.09.23           16300         15700
5   01.08.23           16800         16400
6   01.07.23           15900         16200
7   01.06.23           15800         15500
8   01.05.23           16150         16100
9   01.04.23           16300         15800
10  01.03.23           16200         16200
11  01.02.23           16300         15700

In [5]:
df.isnull().sum()

Date              0
Starting (USD)    0
Ending (USD)      0
dtype: int64

In [ ]:
##date delete
df.delete